
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Доработка Шутова И.Н. Вывод реквизитов
	Группа = Элементы.Добавить("ГруппаДаты",Тип("ГруппаФормы"), ЭтотОбъект );
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Видимость = Ложь;
	
	ПолеВвода = Элементы.Добавить("ДатаНачалаДействия", Тип("ПолеФормы"), Элементы.ГруппаДаты);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействия";
	ПолеВвода = Элементы.Добавить("ДатаОкончанияДействия", Тип("ПолеФормы"), Элементы.ГруппаДаты);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействия";
	
	ГруппаЦена = Элементы.Добавить("ГруппаЦена",Тип("ГруппаФормы"), ЭтотОбъект );
	ГруппаЦена.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаЦена.Видимость = Ложь;
	
	ПолеВвода = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаЦена);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ПолеВвода = Элементы.Добавить("СтоимостьЧаса", Тип("ПолеФормы"), Элементы.ГруппаЦена);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	
	ВидДоговораПриИзмененииНаСервере();
	//Конец доработки вывод реквизитов
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

//Доработка Шутова И.Н. Вывод реквизитов
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание тогда
	Элементы.ГруппаДаты.Видимость = Истина;
	Элементы.ГруппаЦена.Видимость = Истина;
	Иначе
	Элементы.ГруппаДаты.Видимость = Ложь;
	Элементы.ГруппаЦена.Видимость = Ложь;
	КонецЕсли; 
	
КонецПроцедуры
//Конец доработки вывод реквизитов

#КонецОбласти

