#Область СлужебныеПроцедурыИФункции

Процедура ОтправитьСообщение() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияБоту.ТекстСообщения,
	|	ВКМ_УведомленияБоту.Ссылка
	|ИЗ
	|	Справочник.ВКМ_УведомленияБоту КАК ВКМ_УведомленияБоту";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	АдресТелеграм = "api.telegram.org";
	Соединение = Новый HTTPСоединение(АдресТелеграм,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	ДанныеПередачи = Новый Структура;
	ТекстСообщения = Выборка.ТекстСообщения;
	ДанныеПередачи.Вставить ("text", ТекстСообщения);
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеПередачи);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	ТокенТГ = Константы.ВКМ_ТокетТелеграмБот.Получить();
	IDГруппы = Константы.ВКМ_ИдентификаторГруппы.Получить();
	//Адрес = "bot"+ТокенТГ+"/sendMessage?chat_id" + Формат(IDГруппы,"ЧГ=");
	Адрес = "bot" + ТокенТГ + "/sendMessage?chat_id=" + СтрЗаменить(Формат(IDГруппы, "ЧДЦ=; ЧС=; ЧРГ=."), ".", "");
	Запрос = Новый HTTPЗапрос(Адрес,Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Попытка
		Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		ЗаписьЖурналаРегистрации(Нстр("ru='Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
			
 	Если Результат.КодСостояния <> 200 тогда
		ВызватьИсключение "Ошибка соединения";
 	КонецЕсли;
 	
 	СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
 	СправочникОбъект.Удалить();
 	
 	КонецЦикла;			
	
КонецПроцедуры	

#КонецОбласти