#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ЗаблокроватьПроцент();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ЗаблокроватьПроцент();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаблокроватьПроцент()
	Если Запись.Сотрудник.Категория = Перечисления.ВКМ_КатегорииСотрудников.АдминистративныйПерсонал тогда
		Запись.ПроцентОтРабот = 0;
		ЭтаФорма.Элементы.ПроцентОтРабот.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры	
#КонецОбласти
