
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
   // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
Если Не ЗначениеЗаполнено(Объект.Дата) тогда
	ЭтоПерваяЗапись = Истина;
КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	 // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры



&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	  ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоПерваяЗапись = Истина Тогда
	Уведомление = Справочники.ВКМ_УведомленияБоту.СоздатьЭлемент();
    Уведомление.ТекстСообщения = "Закаказ №"+Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
    + ", исполитель " + Объект.Специалист + ", дата проведения работ " 
    + Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + " "
    + Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T;")  + ", проблема - " + Объект.ОписаниеПроблемы;
    Уведомление.Записать();
	Иначе
		Если ЗначениеЗаполнено(ТекстИзменения) тогда
	     Уведомление = Справочники.ВКМ_УведомленияБоту.СоздатьЭлемент();
    Уведомление.ТекстСообщения = "В закаказе №"+Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy") 
    + " произошли изменения. " + ТекстИзменения;
    Уведомление.Записать();
         КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	НужноОтправитьУведомление=Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + "Изменился исполнитель " + Объект.Специалист + " "; 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПроведенияРаботПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилась дата проведения работ " + Формат(Объект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + " ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПланПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилось время начала работ " + Формат(Объект.ВремяНачалаРаботПлан,"ДЛФ=T") + " ";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПланПриИзменении(Элемент)
	Если ЭтоПерваяЗапись = Ложь тогда
	ТекстИзменения = ТекстИзменения + 
	"Изменилось время окончания работ " + Формат(Объект.ВремяОкончанияРаботПлан,"ДЛФ=T") + " " ;
	КонецЕсли;
КонецПроцедуры
#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти