 
 #Область СлужебныеПроцедурыИФункции
 
 Функция СоздатьДокументНаСервере(МесяцНачисления) Экспорт
	 Ошибки = Ложь;
	 Запрос = Новый Запрос;
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор
	 |ПОМЕСТИТЬ СписокДоговоров
	 |ИЗ
	 |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	 |ГДЕ
	 |	ВКМ_ОбслуживаниеКлиента.Дата >= &ДатаНачалаПериода
	 |	И ВКМ_ОбслуживаниеКлиента.Проведен = ИСТИНА
	 |	И ВКМ_ОбслуживаниеКлиента.Дата <= &ДатаОкончанияПериода
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ВКМ_ОбслуживаниеКлиента.Договор
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
	 |	РеализацияТоваровУслуг.Договор КАК Договор
	 |ПОМЕСТИТЬ ВТ_Документы
	 |ИЗ
	 |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	 |ГДЕ
	 |	РеализацияТоваровУслуг.Дата >= &ДатаНачалаПериода
	 |	И РеализацияТоваровУслуг.Дата <= &ДатаОкончанияПериода
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	СписокДоговоров.Договор КАК Договор,
	 |	СписокДоговоров.Договор.Владелец КАК ДоговорВладелец,
	 |	СписокДоговоров.Договор.Организация КАК ДоговорОрганизация,
	 |	СписокДоговоров.Договор.Представление КАК ДоговорПредставление,
	 |	ЕСТЬNULL(ВТ_Документы.Ссылка, 0) КАК Документ
	 |ИЗ
	 |	СписокДоговоров КАК СписокДоговоров
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	 |		ПО СписокДоговоров.Договор = ВТ_Документы.Договор";
	 
	 Запрос.УстановитьПараметр("ДатаНачалаПериода", НачалоМесяца(МесяцНачисления) );
	 Запрос.УстановитьПараметр("ДатаОкончанияПериода", КонецМесяца(МесяцНачисления) );
	 ВыборкаДоговор = Запрос.Выполнить().Выбрать();
	 МассивДоговоров = Новый Массив();
	 МассивДокументов = Новый Массив();
	 Колво=0;
	 
	 Пока ВыборкаДоговор.Следующий() Цикл
		 Реализация = ВыборкаДоговор.Документ;
		 Если Реализация = 0 тогда
			 ДокРеализацииОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			 ДокРеализацииОбъект.Заполнить(ВыборкаДоговор.Договор); 
			 ДокРеализацииОбъект.Записать();
		 Иначе
			 ДокРеализацииСсылка = ВыборкаДоговор.Документ;
			 ДокРеализацииОбъект = ДокРеализацииСсылка.ПолучитьОбъект();
		 КонецЕсли;
		 ДокРеализацииОбъект.ВыполнитьАвтозаполнение(КонецМесяца(МесяцНачисления));
		 Если ДокРеализацииОбъект.ПроверитьЗаполнение() Тогда
			 ДокРеализацииОбъект.Записать(РежимЗаписиДокумента.Проведение);
		 Иначе
			 ДокРеализацииОбъект.Записать();
			 Ошибки = Истина;
		 КонецЕсли;  
		 ДокРеализацииСсылка = ДокРеализацииОбъект.Ссылка;
		 МассивДоговоров.Вставить(Колво, ВыборкаДоговор.Договор);
		 МассивДокументов.Вставить(Колво, ДокРеализацииСсылка);
		 Колво=Колво+1;
	 КонецЦикла;	
	 ТаблДок = Новый Массив();
	 ТаблДок.Вставить(0, МассивДоговоров);
	 ТаблДок.Вставить(1, МассивДокументов);
	 ТаблДок.Вставить(2, Ошибки);
	 Возврат ТаблДок;	
 КонецФункции
 #КонецОбласти