#Область ОписаниеПеременных

&НаКлиенте
Перем АдресГрафикаВХранилище;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Год) тогда	
		Объект.Год = ОбщегоНазначения.ТекущаяДатаПользователя() + 365*24*3600;
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовТаблицыФормыГрафик
&НаКлиенте
Процедура ГрафикПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекущиеДанные = Элементы.График.ТекущиеДанные;
	ДнейОтпускаСтроки = 0;
	ТабОбх = Объект.График;
	Для Каждого стрТабл из ТабОбх Цикл
		Если стрТабл.Сотрудник = ТекущиеДанные.Сотрудник тогда
			ДнейОтпускаСтроки = ДнейОтпускаСтроки + (КонецДня(стрТабл.ДатаОкончания) - стрТабл.ДатаНачала+1)/(3600*24); 
		КонецЕсли;	
	КонецЦикла;
	Если ДнейОтпускаСтроки > 28 тогда
		ТекущиеДанные.Цвет = Истина;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	АдресГрафикаВХранилище = ПоместитьГрафикВХранилище();
	
	ПараметрыПодбора = Новый Структура("АдресГрафикаДокумента", АдресГрафикаВХранилище);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыПодбора, ЭтотОбъект); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере

Функция ПоместитьГрафикВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(Объект.График.Выгрузить( ,"Сотрудник, ДатаНачала, ДатаОкончания"));
	
КонецФункции

#КонецОбласти