#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
	Для Каждого ТекСтрокаГрафик из График Цикл
		Если ТекСтрокаГрафик.ДатаНачала < НачалоГода(Год) 
			или ТекСтрокаГрафик.ДатаОкончания > КонецГода(Год) тогда
			Отказ = Истина;
			ТексСообщения = СтрШаблон("Дата отпуска сотрудника %1 не соответсвует году графика", ТекСтрокаГрафик.Сотрудник);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТексСообщения);
		КонецЕсли;	
		
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период = НачалоГода(Год);
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = ТекСтрокаГрафик.Сотрудник;
		Движение.ДнейОтпуска = (КонецДня(ТекСтрокаГрафик.ДатаОкончания) - ТекСтрокаГрафик.ДатаНачала+1)/(3600*24);
	КонецЦикла;
	
КонецПроцедуры	

#КонецОбласти